MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32M3514C8/mcu.h
        /* capture/compare mode register 2 (input mode) */
        union
        {
            __IOM uint32_t CCM2_INPUT;

            struct
            {
                __IOM uint32_t CC3SEL     : 2;
                __IOM uint32_t IC3PSC     : 2;
                __IOM uint32_t IC3F       : 4;
                __IOM uint32_t CC4SEL     : 2;
                __IOM uint32_t IC4PSC     : 2;
                __IOM uint32_t IC4F       : 4;
                __IM  uint32_t RESERVED1  : 16;
            } CCM2_INPUT_B;
        } ;
    };

    /* capture/compare enable register */
    union
    {
        __IOM uint32_t CCEN;

        struct
        {
            __IOM uint32_t CC1EN      : 1;
            __IOM uint32_t CC1POL     : 1;
            __IOM uint32_t CC1NEN     : 1;
            __IOM uint32_t CC1NPOL    : 1;
            __IOM uint32_t CC2EN      : 1;
            __IOM uint32_t CC2POL     : 1;
            __IOM uint32_t CC2NEN     : 1;
            __IOM uint32_t CC2NPOL    : 1;
            __IOM uint32_t CC3EN      : 1;
            __IOM uint32_t CC3POL     : 1;
            __IOM uint32_t CC3NEN     : 1;
            __IOM uint32_t CC3NPOL    : 1;
            __IOM uint32_t CC4EN      : 1;
            __IOM uint32_t CC4POL     : 1;
            __IM  uint32_t RESERVED1  : 18;
        } CCEN_B;
    } ;

    /* counter */
    union
    {
        __IOM uint32_t CNT;

        struct
        {
            __IOM uint32_t CNT        : 32;
        } CNT_B;
    } ;

    /* prescaler */
    union
    {
        __IOM uint32_t PSC;

        struct
        {
            __IOM uint32_t PSC        : 16;
            __IM  uint32_t RESERVED1  : 16;
        } PSC_B;
    } ;

    /* auto-reload register */
    union
    {
        __IOM uint32_t AUTORLD;

        struct
        {
            __IOM uint32_t AUTORLD    : 32;
        } AUTORLD_B;
    } ;

    /* repetition counter register */
    union
    {
        __IOM uint32_t REPCNT;

        struct
        {
            __IOM uint32_t REPCNT     : 8;
            __IM  uint32_t RESERVED1  : 24;
        } REPCNT_B;
    } ;

    /* capture/compare register 1 */
    union
    {
        __IOM uint32_t CC1;

        struct
        {
            __IOM uint32_t CC1        : 32;
        } CC1_B;
    } ;

    /* capture/compare register 2 */
    union
    {
        __IOM uint32_t CC2;

        struct
        {
            __IOM uint32_t CC2        : 32;
        } CC2_B;
    } ;

    /* capture/compare register 3 */
    union
    {
        __IOM uint32_t CC3;

        struct
        {
            __IOM uint32_t CC3        : 32;
        } CC3_B;
    } ;

    /* capture/compare register 4 */
    union
    {
        __IOM uint32_t CC4;

        struct
        {
            __IOM uint32_t CC4        : 32;
        } CC4_B;
    } ;

    /* break and dead-time register */
    union
    {
        __IOM uint32_t BDT;

        struct
        {
            __IOM uint32_t DTS        : 8;
            __IOM uint32_t LOCKCFG    : 2;
            __IOM uint32_t IMOS       : 1;
            __IOM uint32_t RMOS       : 1;
            __IOM uint32_t BRKEN      : 1;
            __IOM uint32_t BRKPOL     : 1;
            __IOM uint32_t AOEN       : 1;
            __IOM uint32_t MOEN       : 1;
            __IM  uint32_t RESERVED1  : 16;
        } BDT_B;
    } ;

    /* DMA control register */
    union
    {
        __IOM uint32_t DCTRL;

        struct
        {
            __IOM uint32_t DBADDR     : 5;
            __IM  uint32_t RESERVED1  : 3;
            __IOM uint32_t DBLEN      : 5;
            __IM  uint32_t RESERVED2  : 19;
        } DCTRL_B;
    } ;

    /* DMA address for full transfer */
    union
    {
        __IOM uint32_t DMADDR;

        struct
        {
            __IOM uint32_t DMADDR     : 16;
            __IM  uint32_t RESERVED1  : 16;
        } DMADDR_B;
    } ;

    union
    {
        __IOM uint32_t CC1C;

        struct
        {
            __IOM uint32_t CC1C       : 16;
            __IM  uint32_t RESERVED1  : 16;
        } CC1C_B;
    } ;

    union
    {
        __IOM uint32_t CC2C;

        struct
        {
            __IOM uint32_t CC2C       : 16;
            __IM  uint32_t RESERVED1  : 16;
        } CC2C_B;
    } ;

    union
    {
        __IOM uint32_t CC3C;

        struct
        {
            __IOM uint32_t CC3C       : 16;
            __IM  uint32_t RESERVED1  : 16;
        } CC3C_B;
    } ;

    union
    {
        __IOM uint32_t CC5;

        struct
        {
            __IOM uint32_t CC5        : 16;
            __IM  uint32_t RESERVED1  : 16;
        } CC5_B;
    } ;

    union
    {
        __IOM uint32_t CCM3;

        struct
        {
            __IOM uint32_t CC5EN      : 1;
            __IOM uint32_t CC5POL     : 1;
            __IOM uint32_t OC5FEN     : 1;
            __IOM uint32_t OC5PEN     : 1;
            __IOM uint32_t OC5MOD     : 3;
            __IOM uint32_t OC5CEN     : 1;
            __IOM uint32_t OC5OIS     : 1;
            __IM  uint32_t RESERVED1  : 23;
        } CCM3_B;
    } ;

    union
    {
        __IOM uint32_t CTRL3;

        struct
        {
            __IOM uint32_t MMSZE      : 1;
            __IOM uint32_t MMSPE      : 1;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t MMSEL2     : 4;
            __IOM uint32_t OC1AEN     : 1;
            __IOM uint32_t OC2AEN     : 1;
            __IOM uint32_t OC3AEN     : 1;
            __IM  uint32_t RESERVED2  : 21;
        } CTRL3_B;
    } ;

    union
    {
        __IOM uint32_t BKFT;

        struct
        {
            __IOM uint32_t BKF        : 4;
            __IM  uint32_t RESERVED1  : 28;
        } BKFT_B;
    } ;

    union
    {
        __IOM uint32_t M0CPR;

        struct
        {
            __IOM uint32_t CH1_WDATA_SEL    : 2;
            __IOM uint32_t CH2_WDATA_SEL    : 2;
            __IOM uint32_t CH3_WDATA_SEL    : 2;
            __IOM uint32_t PWM_PERIOD_SEL   : 1;
            __IOM uint32_t CCR_NO_BUF       : 1;
            __IOM uint32_t PWM_PDCON_SEL    : 1;
            __IOM uint32_t CH1N_WDATA_SEL   : 2;
            __IOM uint32_t CH2N_WDATA_SEL   : 2;
            __IOM uint32_t CH3N_WDATA_SEL   : 2;
            __IOM uint32_t SVPWM_EN         : 1;
            __IM  uint32_t RESERVED1        : 16;
        } M0CP_B;
    } ;

    union
    {
        __IOM uint32_t OUTPUTCTRL1;

        struct
        {
            __IOM uint32_t CH1_FORCE_EN     : 1;
            __IOM uint32_t CH1N_FORCE_EN    : 1;
            __IOM uint32_t CH2_FORCE_EN     : 1;
            __IOM uint32_t CH2N_FORCE_EN    : 1;
            __IOM uint32_t CH3_FORCE_EN     : 1;
            __IOM uint32_t CH3N_FORCE_EN    : 1;
            __IOM uint32_t CH4_FORCE_EN     : 1;
            __IOM uint32_t CH5_FORCE_EN     : 1;
            __IM  uint32_t RESERVED1        : 7;
            __IOM uint32_t OUTPUTCTRL_BUF   : 1;
            __IM  uint32_t RESERVED2        : 16;
        } OUTPUTCTRL1_B;
    } ;

    union
    {
        __IOM uint32_t OUTPUTCTRL2;

        struct
        {
            __IOM uint32_t CH1_FORCE_VALUE  : 1;
            __IOM uint32_t CH1N_FORCE_VALUE : 1;
            __IOM uint32_t CH2_FORCE_VALUE  : 1;
            __IOM uint32_t CH2N_FORCE_VALUE : 1;
            __IOM uint32_t CH3_FORCE_VALUE  : 1;
            __IOM uint32_t CH3N_FORCE_VALUE : 1;
            __IOM uint32_t CH4_FORCE_VALUE  : 1;
            __IOM uint32_t CH5_FORCE_VALUE  : 1;
            __IM  uint32_t RESERVED1        : 24;
        } OUTPUTCTRL2_B;
    } ;

    union
    {
        __IOM uint32_t CTRL4;

        struct
        {
            __IOM uint32_t MM2SZE     : 1;
            __IOM uint32_t MM2SPE     : 1;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t MM2SEL     : 4;
            __IOM uint32_t MM3SZE     : 1;
            __IOM uint32_t MM3SPE     : 1;
            __IM  uint32_t RESERVED2  : 2;
            __IOM uint32_t MM3SEL     : 4;
            __IM  uint32_t RESERVED3  : 16;
        } CTRL4_B;
    } ;
} TMR_T;

/**
  * @brief Reset and clock control (RCM)
  */

typedef struct
{
    /* Clock control register 1*/
    union
    {
        /* Clock control register */
        __IOM uint32_t CTRL1;

        struct
        {
            __IOM uint32_t HSIEN      : 1;
            __IM  uint32_t HSIRDYFLG  : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t HSITRM     : 5;
            __IM  uint32_t HSICAL     : 8;
            __IOM uint32_t HSEEN      : 1;
            __IM  uint32_t HSERDYFLG  : 1;
            __IOM uint32_t HSEBCFG    : 1;
            __IOM uint32_t CSSEN      : 1;
            __IM  uint32_t RESERVED2  : 4;
            __IOM uint32_t PLLEN      : 1;
            __IM  uint32_t PLLRDYFLG  : 1;
            __IOM uint32_t PLLMULSEL  : 1;
            __IM  uint32_t RESERVED3  : 5;
        } CTRL1_B;
    } ;

    /* Clock configuration register 1*/
    union
    {
        __IOM uint32_t CFG1;

        struct
        {
            __IOM uint32_t SCLKSEL    : 2;
            __IM  uint32_t SCLKSELSTS : 2;
            __IOM uint32_t AHBPSC     : 4;
            __IOM uint32_t APB1PSC    : 3;
            __IM  uint32_t RESERVED1  : 3;
            __IOM uint32_t ADCPSC     : 1;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t PLLSRCSEL  : 1;
            __IOM uint32_t PLLHSEPSC  : 1;
            __IOM uint32_t PLLMULCFG  : 4;
            __IM  uint32_t RESERVED3  : 2;
            __IOM uint32_t MCOSEL     : 3;
            __IM  uint32_t RESERVED4  : 5;
        } CFG1_B;
    } ;

    /* Clock interrupt register*/
    union
    {
        __IOM uint32_t INT;

        struct
        {
            __IM  uint32_t LSIRDYFLG    : 1;
            __IM  uint32_t LSERDYFLG    : 1;
            __IM  uint32_t HSIRDYFLG    : 1;
            __IM  uint32_t HSERDYFLG    : 1;
            __IM  uint32_t PLLRDYFLG    : 1;
            __IM  uint32_t HSI14RDYFLG  : 1;
            __IM  uint32_t RESERVED1    : 1;
            __IM  uint32_t CSSFLG       : 1;
            __IOM uint32_t LSIRDYEN     : 1;
            __IOM uint32_t LSERDYEN     : 1;
            __IOM uint32_t HSIRDYEN     : 1;
            __IOM uint32_t HSERDYEN     : 1;
            __IOM uint32_t PLLRDYEN     : 1;
            __IOM uint32_t HSI14RDYEN   : 1;
            __IM  uint32_t RESERVED2    : 2;
            __OM  uint32_t LSIRDYCLR    : 1;
            __OM  uint32_t LSERDYCLR    : 1;
            __OM  uint32_t HSIRDYCLR    : 1;
            __OM  uint32_t HSERDYCLR    : 1;
            __OM  uint32_t PLLRDYCLR    : 1;
            __OM  uint32_t HSI14RDYCLR  : 1;
            __IM  uint32_t RESERVED3    : 1;
            __OM  uint32_t CSSCLR       : 1;
            __IM  uint32_t RESERVED4    : 8;
        } INT_B;
    } ;

    /* APB2 peripheral reset register*/
    union
    {
        __IOM uint32_t APBRST2;

        struct
        {
            __IOM uint32_t SYSCFGRST  : 1;
            __IM  uint32_t RESERVED1  : 8;
            __IOM uint32_t ADCRST     : 1;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t TMR1RST    : 1;
            __IOM uint32_t SPIRST     : 1;
            __IM  uint32_t RESERVED3  : 1;
            __IOM uint32_t USART1RST  : 1;
            __IM  uint32_t RESERVED4  : 1;
            __IOM uint32_t TMR7RST    : 1;
            __IM  uint32_t RESERVED5  : 5;
            __IOM uint32_t DBGRST     : 1;
            __IM  uint32_t RESERVED6  : 9;
        } APBRST2_B;
    } ;

    /* APB1 peripheral reset register*/
    union
    {
        __IOM uint32_t APBRST1;

        struct
        {
            __IOM uint32_t TMR2RST    : 1;
            __IOM uint32_t TMR3RST    : 1;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t TMR6RST    : 1;
            __IM  uint32_t RESERVED2  : 3;
            __IOM uint32_t TMR4RST    : 1;
            __IM  uint32_t RESERVED3  : 2;
            __IOM uint32_t WWDTRST    : 1;
            __IM  uint32_t RESERVED4  : 5;
            __IOM uint32_t USART2RST  : 1;
            __IM  uint32_t RESERVED5  : 3;
            __IOM uint32_t I2CRST     : 1;
            __IM  uint32_t RESERVED6  : 3;
            __IOM uint32_t CANRST     : 1;
            __IM  uint32_t RESERVED7  : 2;
            __IOM uint32_t PMURST     : 1;
            __IM  uint32_t RESERVED8  : 3;
        } APBRST1_B;
    } ;

    /* AHB Peripheral Clock enable register*/
    union
    {
        __IOM uint32_t AHBCLKEN;

        struct
        {
            __IOM uint32_t DMAEN      : 1;
            __IOM uint32_t RESERVED0  : 1;
            __IOM uint32_t SRAMEN     : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t FMCEN      : 1;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t CRCEN      : 1;
            __IM  uint32_t RESERVED3  : 10;
            __IOM uint32_t PAEN       : 1;
            __IOM uint32_t PBEN       : 1;
            __IOM uint32_t PCEN       : 1;
            __IM  uint32_t RESERVED4  : 2;
            __IOM uint32_t PFEN       : 1;
            __IM  uint32_t RESERVED5  : 1;
            __IOM uint32_t M0CPEN     : 1;
            __IM  uint32_t RESERVED6  : 7;
        } AHBCLKEN_B;
    } ;

    union
    {
        __IOM uint32_t APBCLKEN2;

        struct
        {
            __IOM uint32_t SCFGCOMPEN : 1;
            __IM  uint32_t RESERVED1  : 8;
            __IOM uint32_t ADCEN      : 1;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t TMR1EN     : 1;
            __IOM uint32_t SPIEN      : 1;
            __IM  uint32_t RESERVED3  : 1;
            __IOM uint32_t USART1EN   : 1;
            __IM  uint32_t RESERVED4  : 1;
            __IOM uint32_t TMR7EN     : 1;
            __IM  uint32_t RESERVED5  : 5;
            __IOM uint32_t DBGEN      : 1;
            __IM  uint32_t RESERVED6  : 9;
        } APBCLKEN2_B;
    } ;

