MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32M3514C8/mcu.h
    /* sampling time register */
    union
    {
        __IOM uint32_t SMPTIM;

        struct
        {
            __IOM uint32_t SMPCYCSEL  : 3;
            __IM  uint32_t RESERVED1  : 29;
        } SMPTIM_B;
    } ;

    /* configuration register 3 */
    union
    {
        __IOM uint32_t CFG3;

        struct
        {
            __IOM uint32_t EXTPOLSEL2 : 2;
            __IOM uint32_t EXTTRGSEL2 : 4;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t EXTPOLSEL3 : 2;
            __IOM uint32_t EXTTRGSEL3 : 4;
            __IM  uint32_t RESERVED2  : 18;
        } CFG3_B;
    } ;

    __IM  uint32_t  RESERVED1;

    /* watchdog threshold register */
    union
    {
        __IOM uint32_t AWDT;

        struct
        {
            __IOM uint32_t AWDLT      : 12;
            __IM  uint32_t RESERVED1  : 4;
            __IOM uint32_t AWDHT      : 12;
            __IM  uint32_t RESERVED2  : 4;
        } AWDT_B;
    } ;
    __IM  uint32_t  RESERVED2;

    /* channel selection register */
    union
    {
        __IOM uint32_t CHSEL;

        struct
        {
            __IOM uint32_t CH0SEL     : 1;
            __IOM uint32_t CH1SEL     : 1;
            __IOM uint32_t CH2SEL     : 1;
            __IOM uint32_t CH3SEL     : 1;
            __IOM uint32_t CH4SEL     : 1;
            __IOM uint32_t CH5SEL     : 1;
            __IOM uint32_t CH6SEL     : 1;
            __IOM uint32_t CH7SEL     : 1;
            __IOM uint32_t CH8SEL     : 1;
            __IOM uint32_t CH9SEL     : 1;
            __IOM uint32_t CH10SEL    : 1;
            __IOM uint32_t CH11SEL    : 1;
            __IOM uint32_t CH12SEL    : 1;
            __IOM uint32_t CH13SEL    : 1;
            __IOM uint32_t CH14SEL    : 1;
            __IOM uint32_t CH15SEL    : 1;
            __IOM uint32_t CH16SEL    : 1;
            __IOM uint32_t CH17SEL    : 1;
            __IOM uint32_t CH18SEL    : 1;
            __IM  uint32_t RESERVED1  : 13;
        } CHSEL_B;
    } ;
    __IM  uint32_t  RESERVED3[5];

    /* data register */
    union
    {
        __IM  uint32_t DATA;

        struct
        {
            __IM  uint32_t CDATA      : 16;
            __IM  uint32_t RESERVED1  : 16;
        } DATA_B;
    } ;

    /* SEQ data register*/
    union
    {
        __IOM uint32_t SEQ_DATA[19];

        struct
        {
            __IOM uint32_t DATA       : 16;
            __IM  uint32_t RESERVED1  : 16;
        } SEQ_DATA_B[19];
    } ;

    __IM  uint32_t  RESERVED4[28];

    /* SEQ control register*/
    union
    {
        __IOM uint32_t SEQ_NUM;

        struct
        {
            __IOM uint32_t SEQ_NUM1   : 5;
            __IOM uint32_t SEQ_NUM2   : 5;
            __IOM uint32_t SEQ_NUM3   : 5;
            __IM  uint32_t RESERVED1  : 13;
            __IOM uint32_t SEQ_NUM    : 2;
            __IM  uint32_t RESERVED2  : 2;
        } SEQ_NUM_B;
    } ;

    /* SEQ 1-6 channel register*/
    union
    {
        __IOM uint32_t SEQ_CHANNEL1;

        struct
        {
            __IOM uint32_t CH0        : 5;
            __IOM uint32_t CH1        : 5;
            __IOM uint32_t CH2        : 5;
            __IOM uint32_t CH3        : 5;
            __IOM uint32_t CH4        : 5;
            __IOM uint32_t CH5        : 5;
            __IM  uint32_t RESERVED1  : 2;
        } SEQ_CHANNEL1_B;
    } ;

    /* SEQ 7-12 channel register*/
    union
    {
        __IOM uint32_t SEQ_CHANNEL2;

        struct
        {
            __IOM uint32_t CH6        : 5;
            __IOM uint32_t CH7        : 5;
            __IOM uint32_t CH8        : 5;
            __IOM uint32_t CH9        : 5;
            __IOM uint32_t CH10       : 5;
            __IOM uint32_t CH11       : 5;
            __IM  uint32_t RESERVED1  : 2;
        } SEQ_CHANNEL2_B;
    } ;

    /* SEQ 13-18 channel register*/
    union
    {
        __IOM uint32_t SEQ_CHANNEL3;

        struct
        {
            __IOM uint32_t CH12       : 5;
            __IOM uint32_t CH13       : 5;
            __IOM uint32_t CH14       : 5;
            __IOM uint32_t CH15       : 5;
            __IOM uint32_t CH16       : 5;
            __IOM uint32_t CH17       : 5;
            __IM  uint32_t RESERVED1  : 2;
        } SEQ_CHANNEL3_B;
    } ;

    /* SEQ 19 channel register*/
    union
    {
        __IOM uint32_t SEQ_CHANNEL4;

        struct
        {
            __IOM uint32_t CH18       : 5;
            __IM  uint32_t RESERVED1  : 27;
        } SEQ_CHANNEL4_B;
    } ;
    __IM  uint32_t  RESERVED5[125];

    /* SEQ general configuration register*/
    union
    {
        __IOM uint32_t CCFG;

        struct
        {
            __IM  uint32_t RESERVED1  : 22;
            __IOM uint32_t VREFEN     : 1;
            __IOM uint32_t TSEN       : 1;
            __IOM uint32_t HLAF_VDDEN : 1;
            __IM  uint32_t RESERVED2  : 7;
        } CCFG_B;
    } ;
} ADC_T;

/**
  * @brief System configuration controller (SYSCFG)
  */
typedef struct
{
    /* configuration register 1 */
    union
    {
        __IOM uint32_t CFG1;

        struct
        {
            __IOM uint32_t MMSEL        : 2;
            __IM  uint32_t RESERVED1    : 4;
            __IOM uint32_t IRSEL        : 2;
            __IOM uint32_t ADCDMARMP    : 1;
            __IOM uint32_t USART1TXRMP  : 1;
            __IOM uint32_t USART1RXRMP  : 1;
            __IM  uint32_t RESERVED2    : 5;
            __IOM uint32_t I2CPB6FMP    : 1;
            __IOM uint32_t I2CPB7FMP    : 1;
            __IOM uint32_t I2CPB8FMP    : 1;
            __IOM uint32_t I2CPB9FMP    : 1;
            __IOM uint32_t I2CPC4FMP    : 1;
            __IOM uint32_t I2CPC5FMP    : 1;
            __IOM uint32_t SPIDMARMP    : 1;
            __IM  uint32_t RESERVED3    : 4;
            __IOM uint32_t I2CDMARMP    : 1;
            __IOM uint32_t TMR1DMARMP   : 1;
            __IOM uint32_t TMR2DMARMP   : 1;
            __IOM uint32_t TMR3DMARMP   : 1;
            __IM  uint32_t RESERVED4    : 1;
        } CFG1_B;
    } ;
    __IM  uint32_t  RESERVED;

    /* external interrupt configuration register 1 */
    union
    {

        __IOM uint32_t EINTCFG1;

        struct
        {
            __IOM uint32_t EINT0      : 4;
            __IOM uint32_t EINT1      : 4;
            __IOM uint32_t EINT2      : 4;
            __IOM uint32_t EINT3      : 3;
            __IM  uint32_t RESERVED1  : 17;
        } EINTCFG1_B;
    } ;

