MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32M3514C8/mcu.h
    /* external interrupt configuration register 2 */
    union
    {
        __IOM uint32_t EINTCFG2;

        struct
        {
            __IOM uint32_t EINT4      : 4;
            __IOM uint32_t EINT5      : 4;
            __IOM uint32_t EINT6      : 4;
            __IOM uint32_t EINT7      : 3;
            __IM  uint32_t RESERVED1  : 17;
        } EINTCFG2_B;
    } ;

    /* external interrupt configuration register 3 */
    union
    {
        __IOM uint32_t EINTCFG3;

        struct
        {
            __IOM uint32_t EINT8      : 4;
            __IOM uint32_t EINT9      : 4;
            __IOM uint32_t EINT10     : 4;
            __IOM uint32_t EINT11     : 3;
            __IM  uint32_t RESERVED1  : 17;
        } EINTCFG3_B;
    } ;

    /* external interrupt configuration register 4 */
    union
    {
        __IOM uint32_t EINTCFG4;

        struct
        {
            __IOM uint32_t EINT12     : 4;
            __IOM uint32_t EINT13     : 4;
            __IOM uint32_t EINT14     : 4;
            __IOM uint32_t EINT15     : 3;
            __IM  uint32_t RESERVED1  : 17;
        } EINTCFG4_B;
    } ;

    /* configuration register 2 */
    union
    {
        __IOM uint32_t CFG2;

        struct
        {
            __IOM uint32_t LOCK       : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t PVDLOCK    : 1;
            __IM  uint32_t RESERVED2  : 29;
        } CFG2_B;
    } ;

    __IM  uint32_t  RESERVED1;

    /* data scrambling register */
    union
    {
        __OM  uint32_t DCODE;

        struct
        {
            __OM  uint32_t DKEY       : 32;
        } DCODE_B;
    } ;

    /* instruction scrambling register */
    union
    {
        __OM  uint32_t ICODE;

        struct
        {
            __OM  uint32_t IKEY       : 32;
        } ICODE_B;
    } ;

    /* scrambling enable register */
    union
    {
        __IOM uint32_t CIPHEN;

        struct
        {
            __IOM uint32_t DCIPHEN    : 1;
            __IOM uint32_t ICIPHEN    : 1;
            __IM  uint32_t RESERVED1  : 30;
        } CIPHEN_B;
    } ;

    /* access permission register */
    union
    {
        __IOM uint32_t ACCESSEN;

        struct
        {
            __IOM uint32_t DMAEN      : 1;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t CRCEN      : 1;
            __IM  uint32_t RESERVED2  : 2;
            __IOM uint32_t ADCEN      : 1;
            __IOM uint32_t CANEN      : 1;
            __IM  uint32_t RESERVED3  : 1;
            __IOM uint32_t EINTEN     : 1;
            __IOM uint32_t I2CEN      : 1;
            __IOM uint32_t IWDTEN     : 1;
            __IM  uint32_t RESERVED4  : 1;
            __IOM uint32_t RTCEN      : 1;
            __IOM uint32_t SPIEN      : 1;
            __IOM uint32_t TMR1EN     : 1;
            __IOM uint32_t TMR2EN     : 1;
            __IOM uint32_t TMR3EN     : 1;
            __IOM uint32_t TMR4EN     : 1;
            __IOM uint32_t TMR6EN     : 1;
            __IOM uint32_t TMR7EN     : 1;
            __IOM uint32_t USART1EN   : 1;
            __IOM uint32_t USART2EN   : 1;
            __IOM uint32_t WWDTEN     : 1;
            __IOM uint32_t GPIOAEN    : 1;
            __IOM uint32_t GPIOBEN    : 1;
            __IOM uint32_t GPIOCEN    : 1;
            __IM  uint32_t RESERVED5  : 1;
            __IOM uint32_t GPIOFEN    : 1;
            __IM  uint32_t RESERVED6  : 3;
        } ACCESSEN_B;
    } ;
} SYSCFG_T;

/**
  * @brief Power control (PMU)
  */

typedef struct
{
    /* power control register*/
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t LPDSCFG    : 1;
            __IOM uint32_t PDDSCFG    : 1;
            __IOM uint32_t WUFLGCLR   : 1;
            __IOM uint32_t SBFLGCLR   : 1;
            __IM  uint32_t RESERVED1  : 4;
            __IOM uint32_t BPWEN      : 1;
            __IM  uint32_t RESERVED2  : 23;

        } CTRL_B;
    } ;

    /* power control/status register*/
    union
    {
        __IOM uint32_t CSTS;

        struct
        {
            __IM  uint32_t WUEFLG     : 1;
            __IM  uint32_t SBFLG      : 1;
            __IM  uint32_t RESERVED1  : 6;
            __IOM uint32_t WKUPCFG1   : 1;
            __IOM uint32_t WKUPCFG2   : 1;
            __IM  uint32_t RESERVED2  : 22;
        } CSTS_B;
    } ;
} PMU_T;

/**
  * @brief FMC (FMC)
  */

typedef struct
{

    /* Flash access control register  */
    union
    {
        __IOM uint32_t CTRL1;

        struct
        {
            __IOM uint32_t WS         : 3;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t PBEN       : 1;
            __IM  uint32_t PBSF       : 1;
            __IM  uint32_t RESERVED3  : 26;
        } CTRL1_B;
    } ;

    /* Flash key register  */
    union
    {
        __OM  uint32_t KEY;

        struct
        {
            __OM  uint32_t KEY        : 32;
        } KEY_B;
    } ;

    /* Flash option key register   */
    union
    {
        __OM  uint32_t OBKEY;

        struct
        {
            __OM  uint32_t OBKEY      : 32;
        } OBKEY_B;
    } ;

    /* Flash status register  */
    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IM  uint32_t BUSYF      : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t PEF        : 1;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t WPEF       : 1;
            __IOM uint32_t OCF        : 1;
            __IM  uint32_t RESERVED3  : 26;
        } STS_B;
    } ;

    /* Flash control register */
    union
    {
        __IOM uint32_t CTRL2;

        struct
        {
            __IOM uint32_t PG         : 1;
            __IOM uint32_t PAGEERA    : 1;
            __IOM uint32_t MASSERA    : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t OBP        : 1;
            __IOM uint32_t OBE        : 1;
            __IOM uint32_t STA        : 1;
            __IOM uint32_t LOCK       : 1;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t OBWEN      : 1;
            __IOM uint32_t ERRIE      : 1;
            __IM  uint32_t RESERVED3  : 1;
            __IOM uint32_t OCIE       : 1;
            __IOM uint32_t OBLOAD     : 1;
            __IM  uint32_t RESERVED4  : 18;
        } CTRL2_B;
    } ;

    /* Flash address register */
    union
    {
        __OM  uint32_t ADDR;

        struct
        {
            __OM  uint32_t ADDR       : 32;
        } ADDR_B;
    } ;
    __IM  uint32_t  RESERVED;

    /* Option byte register */
    union
    {
        __IM  uint32_t OBCS;

        struct
        {
            __IM  uint32_t OBE        : 1;
            __IM  uint32_t READPROT   : 2;
            __IM  uint32_t RESERVED1  : 5;
            __IM  uint32_t WDTSEL     : 1;
            __IM  uint32_t RSTSTOP    : 1;
            __IM  uint32_t RSTSTDB    : 1;
            __IM  uint32_t RESERVED2  : 1;
            __IM  uint32_t nBOOT1     : 1;
            __IM  uint32_t VDDAMONI   : 1;
            __IM  uint32_t SRAMPARITY : 1;
            __IM  uint32_t RESERVED3  : 1;
            __IM  uint32_t DATA0      : 8;
            __IM  uint32_t DATA1      : 8;
        } OBCS_B;
    } ;

    /* Write protection register */
    union
    {
        __IM  uint32_t WRTPROT;

        struct
        {
            __IM  uint32_t WRTPROT    : 32;
        } WRTPROT_B;
    } ;
} FMC_T;

/**
  * @brief Debug support (DBG)
  */
typedef struct
{

    /* MCU Device ID Code Register */
    union
    {
        __IM  uint32_t IDCODE;

        struct
        {
            __IM  uint32_t EQR        : 16;
            __IM  uint32_t WVR        : 16;
        } IDCODE_B;
    } ;

    /* Debug MCU Configuration Register */
    union
    {
        __IOM uint32_t CFG;

        struct
        {
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t STOP_CLK_STS     : 1;
            __IOM uint32_t STANDBY_CLK_STS  : 1;
            __IM  uint32_t RESERVED2        : 29;
        } CFG_B;
    } ;

    /* APB Low Freeze Register */
    union
    {
        __IOM uint32_t APB1F;

        struct
        {
            __IOM uint32_t TMR2_STS   : 1;
            __IOM uint32_t TMR3_STS   : 1;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t TMR6_STS   : 1;
            __IM  uint32_t RESERVED2  : 3;
            __IOM uint32_t TMR4_STS   : 1;
            __IM  uint32_t RESERVED3  : 1;
            __IOM uint32_t RTC_STS    : 1;
            __IOM uint32_t WWDT_STS   : 1;
            __IOM uint32_t IWDT_STS   : 1;
            __IM  uint32_t RESERVED4  : 8;
            __IOM uint32_t I2C1_SMBUS_TIMEOUT_STS : 1;
            __IM  uint32_t RESERVED5  : 3;
            __IOM uint32_t CAN_STS    : 1;
            __IM  uint32_t RESERVED6  : 6;
        } APB1F_B;
    } ;

    /* APB High Freeze Register */
    union
    {
        __IOM uint32_t APB2F;

        struct
        {
            __IM  uint32_t RESERVED1  : 11;
            __IOM uint32_t TMR1_STS   : 1;
            __IM  uint32_t RESERVED2  : 4;
            __IOM uint32_t TMR7_STS   : 1;
            __IM  uint32_t RESERVED3  : 15;
        } APB2F_B;
    } ;
} DBG_T;

/**
  * @brief Real-time clock (RTC)
  */

typedef struct
{

